Table of Contents
 Class ValueCount
Namespace
IdeaRS.OpenModel.Parameters
Assembly
IdeaRS.OpenModel.dll
Specifies pair of value and their count.
public sealed class ValueCount
Inheritance
object
ValueCount
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Count
Gets or sets the repeating of value.
public int Count { get; set; }
Property Value
int
 Value
Gets or sets the value.
public double Value { get; set; }
Property Value
double
Methods
 Create(double)
Creates a new instance with specified value.
public static ValueCount Create(double value)
Parameters
value double
The value to set.
Returns
ValueCount
A new instance of ValueCount.
 Create(double, int)
Creates a new instance with value and their repeating.
public static ValueCount Create(double value, int count)
Parameters
value double
The value to set.
count int
The number of repeating.
Returns
ValueCount
A new instance of ValueCount.
 Edit this page